/*******************************************************************************
* 版权所有 (C)2011 深圳市迅雷网络技术有限公司。
* 系统名称  : 迅雷公共库
* 文件名称  : url_utility.h
* 内容摘要  : 
* 当前版本  : 1.0
* 作    者  : 杨晓虎
* 设计日期  : 2011年4月28日
* 修改记录  : 
* 日    期      版    本        修改人      修改摘要
*******************************************************************************/
/**************************** 条件编译选项和头文件 ****************************/
#ifndef __URL_UTILITY_H_A2D090B7_0794_42B2_BD88_50CF8A09933D__
#define __URL_UTILITY_H_A2D090B7_0794_42B2_BD88_50CF8A09933D__

#include "xl_lib/type.h"
#include "xl_lib/tchar.h"

XL_WIN32_NAMESPACE_BEGIN(net)
/********************************** 常量和宏 **********************************/

/********************************** 数据类型 **********************************/

/********************************** 函数声明 **********************************/

/*********************************** 类定义 ***********************************/
class url_utility
{
public:
    static std::string url_encode( const char* origin_str, const char* unreserved_char = "-_.!~*'()" );
    static std::string url_decode( const char* encoded_str );
};

XL_WIN32_NAMESPACE_END(net)

#endif // end of __URL_UTILITY_H_A2D090B7_0794_42B2_BD88_50CF8A09933D__
