/*******************************************************************************
* 版权所有 (C)2010 深圳市迅雷网络技术有限公司。
* 系统名称  : 迅雷公共库
* 文件名称  : shell_utility.h
* 内容摘要  : 包含windows下的一些shell操作函数封装
* 当前版本  : 1.0
* 作    者  : 杨晓虎
* 设计日期  : 2010年6月24日
* 修改记录  : 
* 日    期      版    本        修改人      修改摘要
*******************************************************************************/
/**************************** 条件编译选项和头文件 ****************************/
#ifndef __SHELL_UTILITY_H_C46F7E4A_3F97_4842_8BA0_F406172C6826__
#define __SHELL_UTILITY_H_C46F7E4A_3F97_4842_8BA0_F406172C6826__

#include "xl_lib/type.h"
#include "xl_lib/tchar.h"

XL_NAMESPACE_BEGIN(win32)
/********************************** 常量和宏 **********************************/

/********************************** 数据类型 **********************************/

/********************************** 函数声明 **********************************/

/*********************************** 类定义 ***********************************/

class shell_utility
{
public:
    /*******************************************************************************
    * 函数名称  : shell_utility::CreateProcessAsMediumIntegrity
    * 功能描述  : 在vista和win7中创建进程的权限问题。
                  其实不应该叫权限，准确的说是Integrity，分为高中低三级。
                  默认状态下，IE是低级
                  一般程序是中级
                  安装包运行在高级
                  默认状态下，低级别进程无法向高级别进程发消息（可以通过ChangeWindowMessageFilter解决），
                  无法打开高级别进程创建的内核对象（可以通过创建低级内核对象解决）。
                  调用CreateProcess和ShellExecute创建的的进程都继承了父进程的Integrity级别。
                  这样会导致两个问题
                  1、  安装包启动的进程都是高级，其他途径启动的进程是中级，这样就会遇到一个进程可能工作在不同的Integrity级别出现不同的行为或者bug。
                  例如：工作在高级的进程无法响应Explorer的拖拽事件。
                  2、  某个服务进程全局只有一个，通过安装包启动的服务进程处于高级，其他需要该服务进程的程序处于中级，导致其他进程无法访问服务进程的资源。
                  例如：ThunderService
                  建议以后创建进程时都强制指定Integrity级别为中级，可以避免很多不必要的bug
    * 参　　数  : PCTSTR pszApplicationName
    * 参　　数  : PTSTR pszCommandLine
    * 参　　数  : PPROCESS_INFORMATION pPI
    * 返 回 值  : BOOL 
    * 作　　者  : 刘雨佳
    * 设计日期  : 2010年6月22日
    * 修改日期         修改人         修改内容
    *******************************************************************************/
    #if(_WIN32_WINNT >= 0x0500)
    static BOOL CreateProcessAsMediumIntegrity(PCTSTR pszApplicationName, PTSTR pszCommandLine, PPROCESS_INFORMATION pPI);
    #endif

	/*******************************************************************************
	* 函数名称  : shell_utility::is_process_exist
	* 功能描述  : 检查某个进程是否存在
	* 参　　数  : const xl::tchar *process_name 要检查的进程的名称, 如"explorer.exe"
	* 返 回 值  : bool                          true: 该进程存在 false: 该进程不存在或发生错误
	* 作　　者  : 刘小鑫
	* 设计日期  : 2010年12月6日
	* 修改日期         修改人         修改内容
	*******************************************************************************/
	static bool is_process_exist( const xl::tchar *process_name );
};

XL_NAMESPACE_END(win32)

#endif // end of __SHELL_UTILITY_H_C46F7E4A_3F97_4842_8BA0_F406172C6826__
